## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
df = pd.Series([4,8,15,16,23,42])

In [3]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(df)

pandas.core.series.Series

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
list1 = [4,8,15,16,23,42,'sudh','anurag','shivam','yashee']

In [6]:
df = pd.Series(list1)

In [7]:
print(df)

0         4
1         8
2        15
3        16
4        23
5        42
6      sudh
7    anurag
8    shivam
9    yashee
dtype: object

## Q3. Create a Pandas DataFrame that contains the following data:

Name - Alice, Bob, Claire

Age 25, 30, 27

Gender Female, Male, Female

Then, print the DataFrame.

In [8]:
df = pd.DataFrame({'Name':['Alice', 'Bob', 'Claire'],
                   'Age':[25, 30, 27],
                   'Gender':['Female', 'Male', 'Female']
})

In [9]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

**Pandas Series**, is a one-dimensional labeled array capable of holding data of any type. A Series is a single column of a DataFrame and can be thought of as a basic building block of a DataFrame.

In [10]:
list1 = [4,8,15,16,23,42,'sudh','anurag','shivam','yashee']
df = pd.Series(list1)
print(df)

0         4
1         8
2        15
3        16
4        23
5        42
6      sudh
7    anurag
8    shivam
9    yashee
dtype: object

**DataFrame** is a two-dimensional labeled data structure with columns of potentially different types. It is a primary Pandas object that represents a table of data, similar to a spreadsheet or SQL table

In [11]:
df = pd.DataFrame({'Name':['Alice', 'Bob', 'Claire'],
                   'Age':[25, 30, 27],
                   'Gender':['Female', 'Male', 'Female']
})
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

**drop():** This function is used to remove specified rows or columns from a DataFrame. For example, if you have a DataFrame with a column that is not needed for analysis, you can remove it using the drop() function.

**fillna():** This function is used to fill missing values in a DataFrame with a specified value or method. For example, if your DataFrame has missing values, you can use fillna() to replace the missing values with a mean or median value.

**groupby():** This function is used to group rows in a DataFrame based on one or more columns, and then perform operations on the resulting groups. For example, you can use groupby() to group data by a particular category and then calculate the mean, median or sum of a particular column in each group.

**merge():** This function is used to combine two or more DataFrames into a single DataFrame. For example, if you have two DataFrames that contain related data, you can use merge() to combine them into a single DataFrame.

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [12]:
name = pd.Series(['Alice', 'Bob', 'Charlie', 'Dave'])
age = pd.Series([25, 32, 18, 47])
gender = pd.Series(['F', 'M', 'M', 'M'])

In [13]:
df = pd.DataFrame({'Name': name, 'Age': age, 'Gender': gender})

In [14]:
df

      Name  Age Gender
0    Alice   25      F
1      Bob   32      M
2  Charlie   18      M
3     Dave   47      M